posts/a-model-of-morality.org
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+OPTIONS: toc:nil

#+HUGO_BASE_DIR: /home/shane/var/smulliga/source/git/metaetica/metaetica-hugo
#+HUGO_SECTION: ./post
# #+HUGO_SECTION: ./philosophy

#+TITLE: A Model of Morality Based On Base Reality
#+DATE: <2022-05-24>
#+AUTHOR: Shane Mulligan
#+KEYWORDS: ethics morality

# I want to write an article that clears up certain things like

# Who am I designing this for?
# - Melee and myself

/*Work in progress*/

** Introduction
# Avoid rhetoric. Make something refined and informative.
# The world is going to Hell quickly.

# #+BEGIN_SRC text -n :async :results verbatim code
#   Personal truth once discovered I will try to impose on the world.
#   I can do this by living my truth.
#   However, the more ambitious the truth the less likely it is for people to even believe that a person would possibly sacrifice so much to go after it.
#   i.e. the more you care about something, the more you believe in it and the more you sacrifice for it, the less likely others will be able to fathom that a person could every give up so much for such a thing.
#   The irony here is that faithfulness isn't recognisable these days because noone believes anyone can be faithful.
#   
#   I just think that when you're 
#   
#   im just really strugglnig to stay optimistic right now with regards to 'doing the right thing' / faithful thing.
# #+END_SRC

I want to explore the idea of a moral system
which is based on maximising faithfulness to
base-reality, especially spiritually.

I also want it to be practical in an AI future.

I'll start by writintg out virtues and thoughts, and consolidate as I develop my ideas.

Also, I want it to make sense.

Base on a solid grounding of [[https://www.verywellmind.com/how-spirituality-can-benefit-mental-and-physical-health-3144807][spirituality]], work upwards from there.

Determine spiritual grounding.
- What is their belief in the afterlife?
- What do they want from this life?

---

- Points:
  - People's individual reality
    - Maximise finding identity
  - Not believing from hypocrites' standpoint
  - Authenticity/Fakeness
  - Value of life based on
  - When a human is produced they are a first-class citizen

---

- Issues:
  - What *is* degeneration?
  - Base reality can change
    - The Earth may become scorched, for instance

I would assert that under the assumption the True God is the one who sees you in the most absolutely objective sense.

+ Fantasy is a part of reality :: [[https://www.youtube.com/watch?v=AjgEOLocrus][Carl Jung Talk - The World Within. The Power Of Imagination. - YouTube]]

It's important to come up with my own model of
morality based on my own model of
spirituality.

This is based on my own interpretation of Christianity.
is extremely important, actually.
I see cracks in modern Christianity, and I do not believe it, because of the hypocrisy.


Consider it to be the Confucianism in that I'm
trying to remain in the realm of ethics, and
is intended just for teaching purposes, and perhaps for edification.

*** Prevent this outcome
[[https://biblehub.com/bsb/2_timothy/3.htm][2 Timothy 3]]

#+BEGIN_SRC text -n :async :results verbatim code
  1 But understand this: In the last days terrible times will come. 2 For men will
  be lovers of themselves, lovers of money, boastful, arrogant, abusive,
  disobedient to their parents, ungrateful, unholy, 3 unloving, unforgiving,
  slanderous, without self-control, brutal, without love of good, 4 traitorous,
  reckless, conceited, lovers of pleasure rather than lovers of God, 5 having a
  form of godliness but denying its power. Turn away from such as these!
#+END_SRC

Even having a form of godliness but denying its
power is not good enough.

- See [[https://www.earlychristianwritings.com/thomas/gospelthomas30.html][Thomas 43]]

*** Cornerstones
- Truth over misleading fiction
- Base-reality over simulation
- Natural over virtual
- Consonance and peace of spirit over worldly peace
- Personal morality over social ethics

# - Virtual God

*** To give the reader a moral compass
I want people to be able to read this, agree
or disagree with particular things, extend it if they will, and use it
as the basis for their own moral code, so they
can get on with life and live happily and confidently.

+ Topics to be covered:
  - Belief
  - Truth
  - Virtues
  - Innocence
  - Empathy
  - Integrity
    - Being faithful
    - Being trustworthy
  - Forestalling societal and moral degeneration
  - Confidence
    - Inner peace
    - Girded loins ([[https://mullikine.github.io/posts/living-water/][personal cistern]] defended)
  - Intimate relationship
  - Fulfilment
  - Freedom
    - Offence
  - Thinking and imagination
    - Sanctity of imagination
  - God
    - Defence of the throne of one's heart from a material or untruthful god

** It's important to define what you want to add structure to your life
- This is important to do
  - It's part of morality and fidelity
  - A life without doing this would turn into meaninglessness and chaos

** Juvenile surreality
Is surreality juvenile? Only without God.

https://biblia.com/books/esv/Ro10.2

** Glossaries
- [[http://github.com/mullikine/notes/blob/master/ws/ethics-and-morality/glossary.txt][ethics and morality]]
- [[http://github.com/semiosis/glossaries-gh/blob/master/spirituality.txt][spirituality]]
- [[http://github.com/semiosis/glossaries-gh/blob/master/morality.txt][morality]]
- [[http://github.com/semiosis/glossaries-gh/blob/master/ethics.txt][ethics]]

*** Hamartiology
Sin
- desensitisation
  - individual
  - societal
- degeneration
  - individual
  - societal

A dedicated work in progress:

- https://github.com/hamartiology
- https://hamartiology.github.io/

---

- https://mullikine.github.io/posts/an-anagogical-hermeneutic-of-christianity/

Desensitisation might happen naturally.
However, degeneration is a choice.

** Ethics vs morals
Both morality and ethics loosely have to do with distinguishing the difference
between “good and bad” or “right and wrong.” Many people think of morality as
something that's personal and normative, whereas ethics is the standards of
“good and bad” distinguished by a certain community or social setting.

https://www.diffen.com/difference/Ethics_vs_Morals

Ethics are external standards that are provided by institutions, groups, or
culture to which an individual belongs. For example, lawyers, policemen, and
doctors all have to follow an ethical code laid down by their profession,
regardless of their own feelings or preferences. Ethics can also be considered
a social system or a framework for acceptable behavior.

Morals are also influenced by culture or society, but they are personal
principles created and upheld by individuals themselves.

** Reality vs Truth
Personal truth is reality.

- Santa Clause is real to a child
- As Batman is real to a teenager
  - Though the 
- As perhaps that gods are real to an adult

*** Work out what is *real* to another person
- It's ethical to not

** Why try at all? For understanding and teaching
How many people would freely express their own
personal beliefs?

*** Liberation
- It shouldn't define who we are
- It shouldn't limit our goals

