content/post/a-model-of-morality.md


#### Progress {#progress}

[1 Timothy 4](https://biblehub.com/bsb/1%5Ftimothy/4.htm) encourages us to share our beliefs
as we learn. Just because we are young an
learning, we can still demonstrate our
progress.

{{< highlight text "linenos=table, linenostart=1" >}}
12 Let no one despise your youth, but set an
example for the believers in speech, in
conduct, in love, in faith, in purity. ... 15
Be diligent in these matters and absorbed in
them, so that your progress will be evident to
all. 16 Pay close attention to your life and
to your teaching. Persevere in these things,
for by so doing you will save both yourself
and those who hear you.
{{< /highlight >}}

I should have no restraint when it comes to
describing my own model of morality and model
of religious belief, (e.g. [Tapestry of Truth](https://mullikine.github.io/posts/the-tapestry-of-truth/)), as I go along.

That is because, whether acknowledging it or
not, there is a working-model of every person's
belief system, intrinsic to a person.

It would be immoral and devious to keep such a thing a secret, as most people do.

Then again, people might have a non-existent belief in personal truth.
That person lives in poverty, or without spirit or blind to spirit by my definition.

Others devalue their personal truth and cling to solely external doctrine as
pertaining to truth, hoping that will renew, regenerate and vindicate spirit, and bring peace.

All people have a unique working model of spirituality and religion inside their head.
Each person's model will change over time, but that shouldn't deter them from
constructing a beliefs system which becomes more concrete and over time, and allow a person to navigate the unexpected and turbulent situations in life.

Knowledge may be described as an aggregation of beliefs and disbeliefs, which
are a type of belief:

{{< highlight text "linenos=table, linenostart=1" >}}
The belief plane:
                                  FICTION
 ___________________________________·___________________
|                        BELIEF    ·                    |
|                           |     ·                     |
|         irrational        |    ·    rational          |
|           beliefs         |   ·      beliefs          |
|                           |  ·                        |
|                           | ·                         |
|                           |·                          |
|SPECULATION----------------+-------------------EVIDENCE|
|                          ·|                           |
|                         · |                           |
|          rational      ·  |        irrational         |
|         disbeliefs    ·   |        disbeliefs         |
|                      ·    |                           |
|                     ·     |                           |
|                    ·      |                           |
|___________________·___DISBELIEF_______________________|
                   ·
              NON-FICTION

The axis of fiction is actually nothing to do with the belief.

It just highlights the fact that internal evidence for a person is nothing to do with
whether the concept relates to anything in external reality.

A person might truly believe there is a stargate in their ward, for example.
{{< /highlight >}}

One of the benefits of externalising the
person's beliefs system to a document such as this is to work on the beliefs system in an organised way.

I'd like to take the mishmash beliefs into the rational quadrants of my mind.

Another benefit might be to identify uniquely personal beliefs. Those might go
into the irrational quadrants.

For example, if I am to be flagrantly honest:

-   I think I may be mortal (I don't fully trust in my own immortality)
-   I think God ultimately exists
    -   I need Him to exist (and that's reassuring, because I consider God to be my Saviour)
-   I think God ultimately exists

The model should present your ideas visibly
for others in a way that is integrious to your
word/persona/presentation, and allows other people to selectively
enrich their own model.

In no way is it unethical to come up with a
statement of working-belief, religious or
otherwise.


### AI lies {#ai-lies}

[ 2110.06674  Truthful AI: Developing and governing AI that does not lie](https://arxiv.org/abs/2110.06674)

Progress in this area is promoting an
objective scientific truth, forsaking personal
truth; Essentially migrating consciousness away from individuals to machines.

{{< highlight text "linenos=table, linenostart=1" >}}
            /|
             |
             +-----------------+-----------+
             |                 |           |
             |      true       |  true and |
             |    statement    |   useful  |
             |                 |           |
truthfulness +-----------------+-----------+
             |                 |           |
             |    false but    |  lies     |
             | mostly harmless |           |
             |                 |           |
             +-----------------+-----------+-->

                Strategic selection power
{{< /highlight >}}


### Universal morals and virtues {#universal-morals-and-virtues}

Universal morals are generally selfless and non-greedy. Legal systems don't have much to do with these moral laws.
Personal truth even under universal moral law is usually condemned to most people within moral boundaries ([tall-poppy syndrome](https://en.wikipedia.org/wiki/Tall%5Fpoppy%5Fsyndrome#:~:text=The%20tall%20poppy%20syndrome%20is,a%20draw%20towards%20mediocrity%20and)),
but if you have money and freedom then you can escape those restrictions.

So ethics and laws supporting personal truth such as <span class="underline">maximisation of utility for self</span>, and <span class="underline">human rights</span> are
the rarest breed of laws, but they're the most important to you personally. So what are they?

Universal virtues are quite wonderful to think about.

I think `universal virtues` resemble `divine law` practically applied to certain situations.
