posts/a-model-of-morality.org
*** Universal virtues
- Truth over misleading fiction
  - Base-reality vs simulation
  - Natural vs virtual
- Cooperation over isolation
  - Unity over division
- Innocence over guilt
- Readiness vs reactive
- Space exploration and expansion (external domination) vs improving quality of life on Earth
- Faithfulness vs fearfulness
- Risk of failure (risk-taking) vs inaction
  https://en.wikipedia.org/wiki/Parable_of_the_talents_or_minas
- Distribution vs centralisation of consciousness (Artifical super intelligence)
  - Expansion of consciousness by panspermia
- Sustainability over hedonistic consumption
- Joy over happiness
  - That means peace and contentedness over
- Capitalism over communism
  - Reward for labour
- Purity over promiscuity
- Elimination of poverty over the pursuit of luxury
- Preservation over destruction
- Recycling over replacement
- Diversity over homogenisation
- Empathy over judgement
- Taking care of what needs your care
  - The people in your household
  - The children you raise
  - The animals in your care
- Security over expansion
# - Confidence vs anxiety
- Remembering where you came from vs forgetfulness
- Justice over lawlessness
- Forgiveness over wasting time, and over holding grudges
- Coherence vs meaninglessness
  - Beauty over ugliness
    - But in contrast, truth over fiction
- Needed comfort over needless fact (white lies)
  - There's a better way than using white lies, though
- Peaceful fiction vs anxiety-inducing fact
- No need vs need
- Stillness and the present vs past and future
- Faith vs nihilism
- Freedom vs efficiency
- Optimism vs pessimism

I'm not sure if there is truly such a thing as fiction within physical reality, if there is always some explanation.
But fiction is a useful concept.
The trouble is

It's important to uphold and have a strong grasp of truth because it's a
slippery slope into destruction to go the way of falsehood.

Our entire reality
may be based on that which is true spiritually, and so internalising falehood
may lead to spiritual death, but that is just a theory.

I'm considering designing a way of life or religion based on minimising fiction.

*** Cardinal virtues
#+BEGIN_SRC text -n :async :results verbatim code
  According to this longer scheme there aare seven "virtues." Four of them are called "Cardinal" virtues,
  and the remaining three are called "Theological" virtues. The "Cardinal" ones are those which all
  civilised people recognise: the "Theological" are those which, as a rule, only Christians know about. I
  shall deal with the Theological ones later on: at present I am talking about the four Cardinal virtues.
  (The word "cardinal" has nothing to do with "Cardinals" in the Roman Church. It comes from a Latin
  word meaning "the hinge of a door." These were called "cardinal" virtues because they are, as we
  should say, "pivotal.") They are PRUDENCE, TEMPERANCE, JUSTICE, and FORTITUDE.
#+END_SRC

*** The law of liberty - This is amazing
- https://www.desiringgod.org/messages/the-peril-of-partiality
- https://biblia.com/bible/esv/james/1/25

*** Universal moral laws

It's harder to find them than legal laws. There are far fewer, but they are more =true= than legal laws.

| Personal | Inter-personal | Institutionalised | URL                                                          | Example                     |
|----------+----------------+-------------------+--------------------------------------------------------------+-----------------------------|
|          | ✓              | Yes               | [[https://en.wikipedia.org/wiki/Nuremberg_trials][International law / crimes against humanity]]                  |                             |
| ✓        | ✓              | No                | [[https://en.wikipedia.org/wiki/Divine_law][Law by divine inspiration]]                                    | Christ's law                |
|          | ✓              | No                | [[https://en.wikipedia.org/wiki/Natural_law][Law by human nature, generally]]                               |                             |
| ✓        | ✓              | No                | [[https://en.wikipedia.org/wiki/Theory_of_mind][Theory of mind / empathy]]                                     |                             |
| ✓        |                | No                | Maximisation of utility for self (comes with self-knowledge) |                             |
| ✓        |                | Yes               | [[http://hrlibrary.umn.edu/edumat/hreduseries/hereandnow/Part-5/8_udhr-abbr.htm][Human rights]]                                                 | Freedom from discrimination |

*** Fiction vs truth. Where are morals in fiction? The rise of [, and danger of] fiction
We really need better moral systems based on _personal truth_. It's
important for the preservation of freedom to experience reality truthfully.

We might, for example, add to human rights:
- The right to freely express personal truth.
- The right to form societies free from fiction.
  - Freedom against invisible slavery.

Here are some examples of the rise of fiction:
- Generative AI models
  - DALL-E 2
  - GPT-3
- Deep Fakes
- Propaganda
- Political narratives that constantly change and bewilder
- Movies making you question the nature of reality
- The legacy of scientific theories which are antiquated
  - The 'big bang' is the new flat-earth, for
    example, yet rationalising everything, as
    Pythagoras tried to do, continues to detract
    from personal truth/reality.

