content/post/a-model-of-morality.md


#### What can we use? {#what-can-we-use}

`International law` is too terse to be useful for much else than a war crime.

{{< highlight text "linenos=table, linenostart=1" >}}
precept
    A general rule intended to regulate
    behaviour or thought.

    "the legal precept of being innocent until
    proven guilty"

    "fail to observe the precepts of God"

divine law
    - Inclusive of precepts of God

    https://dsc.duq.edu/cgi/viewcontent.cgi?filename=4&article=1015&context=beth&type=additional

precepts of God
{{< /highlight >}}

I have recently developed my understanding of what `divine law` is.
I now think divine law is actually quite legitimate.
If you think about it, to understand or speak to God you must `a)` know yourself, `b)`
become selfless, and `c)` understand the concept of God (which are these impossible virtues).

This has happened over millennia, where the
most inspired people have created and
repudiated scripture.

If nothing else, consider divine law to be
selfless inspiration of law over a very long
period of time, ever-improving, which attempts
to uncover transcendent moral law. The further
back in time you go, the less reliable is this
law in my opinion, but the further back in
time you go, there is another type of evidence (provenance) which in some way gives weight
to future innovations.

-   <https://en.wikipedia.org/wiki/Five%5Fprecepts%5F(Taoism)>
-   <https://en.wikipedia.org/wiki/Ten%5Fprecepts%5F(Taoism)>
-   <https://en.wikipedia.org/wiki/Ten%5FCommandments>
    -   honesty, faithfulness, humility, respect to others, self-respect (against addiction),
    -   temperance (not greedy)
-   <https://en.wikipedia.org/wiki/Great%5FCommandment>
-   <https://en.wikipedia.org/wiki/Five%5Fprecepts>
-   <https://en.wikipedia.org/wiki/Five%5FPrinciples%5Fof%5FPeaceful%5FCoexistence>
-   <https://en.wikipedia.org/wiki/Teachings%5Fof%5FFalun%5FGong>
    -   truth, compassion and forbearance
-   <https://blog.une.edu.au/new-england-muslims/2019/11/14/the-75-good-manners-commandments-in-the-quran/comment-page-1/>

<span class="underline">Natural law</span> might _seem_ to acknowledging personal truth, however it is
still disconnected from personal truth and theory of mind. Actually it's more like consensus truth.

I think the sweet spot for universal law
should be a conscious compromise of all of the
above.

The best way to protect against fiction is upholding divine law, universal virtues and human rights, I believe.

This can be done in 2 stages:

-   Firstly, acknowledge and educate people on the ideals of divine law, universal virtues and human rights
    -   Make it so everybody knows these things.
    -   Call accordance to these things `good`, and discordance `evil`. Uphold good.
-   Enshrine these values into universal law
    -   Keep the laws abstract enough not to discriminate, and neither to become partial (reduce innocence).
        -   Base reality for children should be free of manipulation

Accepting the reality that personal truth is hard to measure, the easiest way to preserve this is probably keeping everybody free.


#### Attacks against personal truth {#attacks-against-personal-truth}

Let's state some facts along with the lie, and the truth:

| Fact                      | Lie                                               | Truth                                                                                                |
|---------------------------|---------------------------------------------------|------------------------------------------------------------------------------------------------------|
| Lots of multiverse movies | Your existence is nothing special                 | You are a spiritual being, a demi-god.                                                               |
| Joe Biden is in office    | We have conscious governance of society           | The political narrative is a fictional story designed to smooth over the underlying economic forces. |
| Many religions            | One of these is objectively the one-true religion | The only one-true religion is your personal relationship with God.                                   |

Personal truth (spirit) is your base-reality, not what
is external to you, which society would have
you believe.

What is personal truth? Answer: [Tapestry of Truth](https://mullikine.github.io/posts/the-tapestry-of-truth/)


### Avoiding disingenuous additions to the model of ethics {#avoiding-disingenuous-additions-to-the-model-of-ethics}

A case in point: Gloriavale.

At some stage while inventing a statement of
belief a person would usually begin to make
compromises for self-gain.

If there is a passage of scripture, for example, which would be self-serving in
a covetous way, some people would pick these things as keystones for the belief
system, and work around them.

I will endeavour to avoid doing this, but it must be
acknowledged that for this reason I self-sabotage
and it's not dishonest to say that
while some things I may consider in some
situations to be unethical or sinful generally, or to bring
about deviously, under different circumstances things
may be innocuous, merciful and 'right' in a
very natural and soulmate or absolute truth kind of way.

Absolute truth is rare - it's spiritual truth,
and is easily able to be deluged with lies to
the point where no innocence remains in a
human being.


### Light and darkness, truth and lie, life and death {#light-and-darkness-truth-and-lie-life-and-death}

{{< highlight text "linenos=table, linenostart=1" >}}
darkness
    Lies - no truth, particularly with respect to your own spiritual.
    No ability to project truth.
    The corpse that is the world.
    No freedom.
{{< /highlight >}}


### Empathy over compassion {#empathy-over-compassion}

{{< highlight text "linenos=table, linenostart=1" >}}
empathy
    The capacity to understand or feel what
    another person is experiencing from within
    their frame of reference, that is, the
    capacity to place oneself in another's
    position.

compassion
    Sympathetic pity and concern for the
    sufferings or misfortunes of others.
    "the victims should be treated with
    compassion"
{{< /highlight >}}

God the Father has sympathy, and His empathy was shown through sending Jesus.
Jesus taught empathy.

The Great Commandment: `Matthew 22:37–39`
: “Thou shalt love the Lord thy God with all thy heart, and with all thy soul, and with all thy mind. “This is the first and great commandment. “And the second is like unto it, Thou shalt love thy neighbour as thyself”


### Integrity {#integrity}


#### Vedhaantha - Hinduism {#vedhaantha-hinduism}

The teachings of Sri Sathya Sai (Indian guru) point to integrity bringing forth bliss, truth and joy. In this I can relate.
To have this a person must walk in their truth and external actions must reflect the inside.

-   <https://mullikine.github.io/posts/living-water/>

-   Teachings of _**Sri Sathya Sai**_:
    -   <https://www.sathyasai.org/>
    -   <https://www.sssbpt.info/ssspeaks/volume14/sss14-34.pdf>
    -   <https://www.sssbpt.info/ssspeaks/volume15/sss15-35.pdf>

Every man should strive to achieve unity in thought, word and deed.

This profound truth is proclaimed by the
Vedhaanthik pronouncement that the body is a
temple in which the [eternal Aathma](https://www.sssbpt.info/ssspeaks/volume15/sss15-35.pdf) is the Indweller.

"Manas-anyath, vachas-anyath, karmanya-anyath dhuraathmanaam"
: The wicked are those whose thoughts deviate from their words and actions.

The Veda is dualistic. Vedhaantha is monistic (Adhvaitha).

The essence of Vedhaantha is the triune unity of thought, word and
deed. In this unity, true bliss can be experienced.

It will also demonstrate the spiritual basis of divinity.

All study of Vedhaantha is of no avail if the precepts are not practised.
