content/post/a-model-of-morality.md


#### In Christian terms {#in-christian-terms}

Water baptism - dedication to the obedience of divine precepts, from the heart,
and the unity of inner and outer truth aligns your heart to God, so that you can see God.
Bliss comes from this.


### Integrity and fulfilment {#integrity-and-fulfilment}

How can a person have a fulfilling life whilst being a person of integrity?

I want to explain what integrity means to me.

Then I want to talk about freedom and the limits of freedom with regard to integrity.

In order to define integrity I need a definition of innocence, since integrity retrains freedom and freedom has an effect on the .


### Fiction vs reality {#fiction-vs-reality}

-   Which is more important?
-   When should fiction be used?
-   How should reality be upheld?
    -   What hurts a person?
    -   What gives peace to a person?

Peace and anxiety are good indicators of
reality for an individual.


### Depth of reality {#depth-of-reality}


#### Internal reality {#internal-reality}

| Depth | Layer name          | Innocently conscious of             | Examples        | Fiction level     |
|-------|---------------------|-------------------------------------|-----------------|-------------------|
| 0     | Inner truth         |                                     | Spirit          | Totally real      |
| 1     | Peace and anxiety   | ✓                                   | Gut feelings    | Fairly trust      |
| 2     | Situational reality | ✓                                   | Physical health | Quite real        |
| 3     | Existential reality | Consideration of this is an anxiety | Social barriers | Totally fictional |
| 4     | Empathetic          | Consideration of this               |                 | Fairy-tale        |


#### External reality {#external-reality}

| Depth | Layer name           | Normally conscious of | Examples                  |
|-------|----------------------|-----------------------|---------------------------|
| 0     |                      |                       | Geographic location       |
| 1     | Immediate sensory    |                       | Immediate air temperature |
| 2     |                      |                       | City census               |
| 3     | Artefact             |                       | Historical photo          |
| 3     |                      |                       | Report card               |
| 4     |                      |                       | Marvel comic              |
| 5     | AI-generated fiction |                       | AI-generated stock photo  |


## I should do my best to avoid these {#i-should-do-my-best-to-avoid-these}


### Deconstruction of Morality {#deconstruction-of-morality}

The following is exactly what the world is like these days.

[2 Timothy 3:1-5 New Living Translation (NLT)](https://www.bible.com/bible/compare/2TI.3.1-5)
: You should know this, Timothy, that in the
    last days there will be very difficult times.
    For people will love only themselves and their
    money. They will be boastful and proud,
    scoffing at God, disobedient to their parents,
    and ungrateful. They will consider nothing
    sacred. They will be unloving and unforgiving;
    they will slander others and have no self-
    control. They will be cruel and hate what is
    good. They will betray their friends, be
    reckless, be puffed up with pride, and love
    pleasure rather than God. They will act
    religious, but they will reject the power that
    could make them godly. Stay away from people
    like that!

Immorality isn't just about sex it is about
our whole lives it's sexuality is just one
part of immorality but also lying and stealing
and violence and corruption and selfishness
and all those kinds of things and so
immorality is like a cancer that spreads everywhere.

-   [Deconstruction of Morality | Tipping Point | End Times Teaching | Jimmy Evans - YouTube](https://www.youtube.com/watch?v=xvKoOm6jSzA)


### Goals {#goals}

-   Define base-reality
-   It must:
    -   have a spiritual basis
        -   accommodate Carl Jung's theory of spirituality (based on the psyche)
            -   Do this so I can present it to non-spiritual people who believes in consciousness
        -   accommodate orthodox Christian theory of spirituality
    -   accommodate relative sin
    -   accommodate absolute sin


#### Maximise {#maximise}

-   Output over input (life)


### Because of LLMs {#because-of-llms}


### What is spirit? {#what-is-spirit}


### What is base reality? {#what-is-base-reality}

-   Spiritual > Physical > Virtual
-   Spiritual > Virtual > Physical
-   Physical > Virtual

When spirituality is not involved, physically is more important than virtually.
However, when spirituality **is** involved, virtual is more important than physical.


### What does spiritual health look like? {#what-does-spiritual-health-look-like}

-   androgenous
-   spiritual marriage to Christ


### Sex and consent {#sex-and-consent}


#### Intimate relationship {#intimate-relationship}

-   [The Lefts Hypocritical View of Sex and Consent | Jordan Peterson & Dave Rubin | #shorts - YouTube](https://www.youtube.com/watch?v=6spdAstl34A)


### Truth {#truth}


#### Asymmetry {#asymmetry}

-   We do far more reading these days than writing

<!--list-separator-->

-  It's more truthful to write a lot

    Writing a lot is what honest people do.


### Is it even moral to **not** come up with your own moral code? {#is-it-even-moral-to-not-come-up-with-your-own-moral-code}

-   Is it moral to not moralise?


### The objective with religion {#the-objective-with-religion}


#### Should be about acquiring spiritual maturity {#should-be-about-acquiring-spiritual-maturity}

What does that feel like?

-   confidence
-   peace
-   fearlessness

<!--list-separator-->

-  After that?

    -   Remaining true with regards to what?
        -   What is next step?
        -   Are there any?


#### Knowing Christian scripture too well causes people to become extremely confused. {#knowing-christian-scripture-too-well-causes-people-to-become-extremely-confused-dot}


### When a person becomes fully-resolved then that person does not deter {#when-a-person-becomes-fully-resolved-then-that-person-does-not-deter}

At this point they are a stable individual and
should be allowed what they deem to be their
needs.


### Coming up with a model of Religious belief and faith {#coming-up-with-a-model-of-religious-belief-and-faith}

This needs to be done.
It has to be done because otherwise nothing makes sense.


### Morality by factoring in vices {#morality-by-factoring-in-vices}

Is it possible to have morality while
incorporating natural human emotions?


#### Avoiding vices {#avoiding-vices}

-   Lust
-   Gluttony
-   Greed
-   Sloth
-   Wrath or ANGER
-   Envy
-   Pride


## Maturity is **always** a good thing when it comes to relationships, apparently {#maturity-is-always-a-good-thing-when-it-comes-to-relationships-apparently}

What's the difference between maturity and degeneracy?